---
title: MEPCurveType
classe: Autodesk.Revit.DB.MEPCurveType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObjAttributes
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# MEPCurveType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FamilySymbol Cross { get; set; }` | `mEPCurveType.Cross` | FamilySymbol |
| `FamilySymbol Elbow { get; set; }` | `mEPCurveType.Elbow` | FamilySymbol |
| `FamilySymbol MultiShapeTransition { get; set; }` | `mEPCurveType.MultiShapeTransition` | FamilySymbol |
| `JunctionType PreferredJunctionType { get; set; }` | `mEPCurveType.PreferredJunctionType` | JunctionType |
| `Double Roughness { get; set; }` | `mEPCurveType.Roughness` | Double |
| `RoutingPreferenceManager RoutingPreferenceManager { get; }` | `mEPCurveType.RoutingPreferenceManager` | RoutingPreferenceManager |
| `ConnectorProfileType Shape { get; }` | `mEPCurveType.Shape` | ConnectorProfileType |
| `FamilySymbol Tap { get; set; }` | `mEPCurveType.Tap` | FamilySymbol |
| `FamilySymbol Tee { get; set; }` | `mEPCurveType.Tee` | FamilySymbol |
| `FamilySymbol Transition { get; set; }` | `mEPCurveType.Transition` | FamilySymbol |
| `FamilySymbol Union { get; set; }` | `mEPCurveType.Union` | FamilySymbol |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```